In [2]:
import pandas as pd
import numpy as np
import math

In [92]:
data = pd.read_csv("Task 5_home-credit-default-risk/application_train.csv")
data.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

In [93]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307511 entries, 0 to 307510
Columns: 122 entries, SK_ID_CURR to AMT_REQ_CREDIT_BUREAU_YEAR
dtypes: float64(65), int64(41), object(16)
memory usage: 286.2+ MB

In [94]:
#filter klien yang mampu melakukan pelunasan
data = data[(data["TARGET"]!=1)]
data.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
5,100008,0,Cash loans,M,N,Y,0,99000.0,490495.5,27517.5,...,0,0,0,0,0.0,0.0,0.0,0.0,1.0,1.0

In [95]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 282686 entries, 1 to 307510
Columns: 122 entries, SK_ID_CURR to AMT_REQ_CREDIT_BUREAU_YEAR
dtypes: float64(65), int64(41), object(16)
memory usage: 265.3+ MB

In [96]:
#Batas Awal Pemberian Pinjaman,dengan misal adalah 500k
data_batas_awal = data[["SK_ID_CURR", "DAYS_BIRTH", "OCCUPATION_TYPE", "AMT_INCOME_TOTAL"]]
data_batas_awal.head()

   SK_ID_CURR  DAYS_BIRTH OCCUPATION_TYPE  AMT_INCOME_TOTAL
1      100003      -16765      Core staff          270000.0
2      100004      -19046        Laborers           67500.0
3      100006      -19005        Laborers          135000.0
4      100007      -19932      Core staff          121500.0
5      100008      -16941        Laborers           99000.0

In [97]:
data_batas_awal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 282686 entries, 1 to 307510
Data columns (total 4 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   SK_ID_CURR        282686 non-null  int64
 1   DAYS_BIRTH        282686 non-null  int64
 2   OCCUPATION_TYPE   192573 non-null  object
 3   AMT_INCOME_TOTAL  282686 non-null  float64
dtypes: float64(1), int64(2), object(1)
memory usage: 10.8+ MB

In [98]:
data_batas_awal = data_batas_awal.assign(AGE_BIRTH = data_batas_awal["DAYS_BIRTH"]/365)
data_batas_awal.head()

   SK_ID_CURR  DAYS_BIRTH OCCUPATION_TYPE  AMT_INCOME_TOTAL  AGE_BIRTH
1      100003      -16765      Core staff          270000.0 -45.931507
2      100004      -19046        Laborers           67500.0 -52.180822
3      100006      -19005        Laborers          135000.0 -52.068493
4      100007      -19932      Core staff          121500.0 -54.608219
5      100008      -16941        Laborers           99000.0 -46.413699

In [99]:
data_batas_awal["AGE_BIRTH"] = round(data_batas_awal["AGE_BIRTH"])
data_batas_awal.head()

   SK_ID_CURR  DAYS_BIRTH OCCUPATION_TYPE  AMT_INCOME_TOTAL  AGE_BIRTH
1      100003      -16765      Core staff          270000.0      -46.0
2      100004      -19046        Laborers           67500.0      -52.0
3      100006      -19005        Laborers          135000.0      -52.0
4      100007      -19932      Core staff          121500.0      -55.0
5      100008      -16941        Laborers           99000.0      -46.0

In [100]:
data_batas_awal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 282686 entries, 1 to 307510
Data columns (total 5 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   SK_ID_CURR        282686 non-null  int64
 1   DAYS_BIRTH        282686 non-null  int64
 2   OCCUPATION_TYPE   192573 non-null  object
 3   AMT_INCOME_TOTAL  282686 non-null  float64
 4   AGE_BIRTH         282686 non-null  float64
dtypes: float64(2), int64(2), object(1)
memory usage: 12.9+ MB

In [101]:
data_batas_awal["AGE_BIRTH"] = data_batas_awal["AGE_BIRTH"].astype("int64")
data_batas_awal.head()

   SK_ID_CURR  DAYS_BIRTH OCCUPATION_TYPE  AMT_INCOME_TOTAL  AGE_BIRTH
1      100003      -16765      Core staff          270000.0        -46
2      100004      -19046        Laborers           67500.0        -52
3      100006      -19005        Laborers          135000.0        -52
4      100007      -19932      Core staff          121500.0        -55
5      100008      -16941        Laborers           99000.0        -46

In [102]:
data_batas_awal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 282686 entries, 1 to 307510
Data columns (total 5 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   SK_ID_CURR        282686 non-null  int64
 1   DAYS_BIRTH        282686 non-null  int64
 2   OCCUPATION_TYPE   192573 non-null  object
 3   AMT_INCOME_TOTAL  282686 non-null  float64
 4   AGE_BIRTH         282686 non-null  int64
dtypes: float64(1), int64(3), object(1)
memory usage: 12.9+ MB

In [103]:
data_batas_awal.isna().sum()

SK_ID_CURR              0
DAYS_BIRTH              0
OCCUPATION_TYPE     90113
AMT_INCOME_TOTAL        0
AGE_BIRTH               0
dtype: int64

In [104]:
#menangani missing value pada kolom OCCUPATION_TYPE
data_batas_awal = data_batas_awal.fillna("Tidak Bekerja")
data_batas_awal.head()

   SK_ID_CURR  DAYS_BIRTH OCCUPATION_TYPE  AMT_INCOME_TOTAL  AGE_BIRTH
1      100003      -16765      Core staff          270000.0        -46
2      100004      -19046        Laborers           67500.0        -52
3      100006      -19005        Laborers          135000.0        -52
4      100007      -19932      Core staff          121500.0        -55
5      100008      -16941        Laborers           99000.0        -46

In [105]:
data_batas_awal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 282686 entries, 1 to 307510
Data columns (total 5 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   SK_ID_CURR        282686 non-null  int64
 1   DAYS_BIRTH        282686 non-null  int64
 2   OCCUPATION_TYPE   282686 non-null  object
 3   AMT_INCOME_TOTAL  282686 non-null  float64
 4   AGE_BIRTH         282686 non-null  int64
dtypes: float64(1), int64(3), object(1)
memory usage: 12.9+ MB

In [106]:
data_batas_awal.groupby('AMT_INCOME_TOTAL')['SK_ID_CURR'].count()

AMT_INCOME_TOTAL
25650.0        1
26100.0        3
26460.0        1
26550.0        2
27000.0       63
              ..
4500000.0      4
6750000.0      1
9000000.0      1
13500000.0     1
18000090.0     1
Name: DAYS_BIRTH, Length: 2450, dtype: int64

In [107]:
data_batas_awal.groupby('OCCUPATION_TYPE')['SK_ID_CURR'].count()

OCCUPATION_TYPE
Accountants               9339
Cleaning staff            4206
Cooking staff             5325
Core staff               25832
Drivers                  16496
HR staff                   527
High skill tech staff    10679
IT staff                   492
Laborers                 49348
Low-skill Laborers        1734
Managers                 20043
Medicine staff            7965
Private service staff     2477
Realty agents              692
Sales staff              29010
Secretaries               1213
Security staff            5999
Tidak Bekerja            90113
Waiters/barmen staff      1196
Name: DAYS_BIRTH, dtype: int64

In [108]:
data_batas_awal.groupby('AGE_BIRTH')['SK_ID_CURR'].count()

AGE_BIRTH
-69     301
-68    1606
-67    1767
-66    2547
-65    4096
-64    4773
-63    5154
-62    5086
-61    5482
-60    6275
-59    6116
-58    6027
-57    6556
-56    6261
-55    6734
-54    7009
-53    6627
-52    6297
-51    5951
-50    6232
-49    6264
-48    6434
-47    6659
-46    6751
-45    6827
-44    7499
-43    7635
-42    7655
-41    7828
-40    7880
-39    8277
-38    8024
-37    7926
-36    7362
-35    6999
-34    6890
-33    6973
-32    7459
-31    7171
-30    6891
-29    6797
-28    7492
-27    5667
-26    3937
-25    3641
-24    3379
-23    3152
-22    1733
-21     587
Name: DAYS_BIRTH, dtype: int64

In [109]:
#Penambahan Batas Awal Pemberian Pinjaman
penambahan_data_batas_awal = data[["SK_ID_CURR", "CNT_CHILDREN", "CNT_FAM_MEMBERS", "FLAG_OWN_CAR", "FLAG_OWN_REALTY", "AMT_CREDIT", "FLAG_MOBIL", "FLAG_PHONE"]]
penambahan_data_batas_awal.head()

,SK_ID_CURR,CNT_CHILDREN,CNT_FAM_MEMBERS,FLAG_OWN_CAR,FLAG_OWN_REALTY,AMT_CREDIT,FLAG_MOBIL,FLAG_PHONE
1,100003,0,2.0,N,N,1293502.5,1,1
2,100004,0,1.0,Y,Y,135000.0,1,1
3,100006,0,2.0,N,Y,312682.5,1,0
4,100007,0,1.0,N,Y,513000.0,1,0
5,100008,0,2.0,N,Y,490495.5,1,1

In [110]:
penambahan_data_batas_awal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 282686 entries, 1 to 307510
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   SK_ID_CURR       282686 non-null  int64
 1   CNT_CHILDREN     282686 non-null  int64
 2   CNT_FAM_MEMBERS  282684 non-null  float64
 3   FLAG_OWN_CAR     282686 non-null  object
 4   FLAG_OWN_REALTY  282686 non-null  object
 5   AMT_CREDIT       282686 non-null  float64
 6   FLAG_MOBIL       282686 non-null  int64
 7   FLAG_PHONE       282686 non-null  int64
dtypes: float64(2), int64(4), object(2)
memory usage: 19.4+ MB

In [112]:
penambahan_data_batas_awal.isna().sum()

SK_ID_CURR         0
CNT_CHILDREN       0
CNT_FAM_MEMBERS    2
FLAG_OWN_CAR       0
FLAG_OWN_REALTY    0
AMT_CREDIT         0
FLAG_MOBIL         0
FLAG_PHONE         0
dtype: int64

In [113]:
#menangani missing value pada kolom OCCUPATION_TYPE
penambahan_data_batas_awal = penambahan_data_batas_awal.fillna("Belum Menikah")
penambahan_data_batas_awal.head()

,SK_ID_CURR,CNT_CHILDREN,CNT_FAM_MEMBERS,FLAG_OWN_CAR,FLAG_OWN_REALTY,AMT_CREDIT,FLAG_MOBIL,FLAG_PHONE
1,100003,0,2.0,N,N,1293502.5,1,1
2,100004,0,1.0,Y,Y,135000.0,1,1
3,100006,0,2.0,N,Y,312682.5,1,0
4,100007,0,1.0,N,Y,513000.0,1,0
5,100008,0,2.0,N,Y,490495.5,1,1

In [114]:
penambahan_data_batas_awal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 282686 entries, 1 to 307510
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   SK_ID_CURR       282686 non-null  int64
 1   CNT_CHILDREN     282686 non-null  int64
 2   CNT_FAM_MEMBERS  282686 non-null  object
 3   FLAG_OWN_CAR     282686 non-null  object
 4   FLAG_OWN_REALTY  282686 non-null  object
 5   AMT_CREDIT       282686 non-null  float64
 6   FLAG_MOBIL       282686 non-null  int64
 7   FLAG_PHONE       282686 non-null  int64
dtypes: float64(1), int64(4), object(3)
memory usage: 19.4+ MB

In [116]:
penambahan_data_batas_awal.groupby('FLAG_PHONE')['SK_ID_CURR'].count()

FLAG_PHONE
0    202336
1     80350
Name: SK_ID_CURR, dtype: int64

In [117]:
penambahan_data_batas_awal.groupby('FLAG_MOBIL')['SK_ID_CURR'].count()

FLAG_MOBIL
0         1
1    282685
Name: SK_ID_CURR, dtype: int64

In [118]:
penambahan_data_batas_awal.groupby('AMT_CREDIT')['SK_ID_CURR'].count()

AMT_CREDIT
45000.0      218
47970.0      209
48519.0        1
49455.0       18
49500.0       40
            ...
3600000.0      2
3860019.0      1
3956274.0      1
4031032.5      1
4050000.0      8
Name: SK_ID_CURR, Length: 5488, dtype: int64

In [119]:
penambahan_data_batas_awal.groupby('FLAG_OWN_REALTY')['SK_ID_CURR'].count()

FLAG_OWN_REALTY
N     86357
Y    196329
Name: SK_ID_CURR, dtype: int64

In [120]:
penambahan_data_batas_awal.groupby('FLAG_OWN_CAR')['SK_ID_CURR'].count()

FLAG_OWN_CAR
N    185675
Y     97011
Name: SK_ID_CURR, dtype: int64

In [121]:
penambahan_data_batas_awal.groupby('CNT_FAM_MEMBERS')['SK_ID_CURR'].count()

CNT_FAM_MEMBERS
1.0               62172
2.0              146348
3.0               47993
4.0               22561
5.0                3151
6.0                 353
7.0                  75
8.0                  14
9.0                   6
10.0                  2
12.0                  2
14.0                  2
15.0                  1
16.0                  2
20.0                  2
Belum Menikah         2
Name: SK_ID_CURR, dtype: int64

In [122]:
penambahan_data_batas_awal.groupby('CNT_CHILDREN')['SK_ID_CURR'].count()

CNT_CHILDREN
0     198762
1      55665
2      24416
3       3359
4        374
5         77
6         15
7          7
8          2
10         2
12         2
14         3
19         2
Name: SK_ID_CURR, dtype: int64

In [3]:
#Riwayat Peminjaman
data_riwayat_peminjaman_1 = pd.read_csv("Task 5_home-credit-default-risk/bureau.csv")
data_riwayat_peminjaman_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1716428 entries, 0 to 1716427
Data columns (total 17 columns):
 #   Column                  Dtype
---  ------                  -----
 0   SK_ID_CURR              int64
 1   SK_ID_BUREAU            int64
 2   CREDIT_ACTIVE           object
 3   CREDIT_CURRENCY         object
 4   DAYS_CREDIT             int64
 5   CREDIT_DAY_OVERDUE      int64
 6   DAYS_CREDIT_ENDDATE     float64
 7   DAYS_ENDDATE_FACT       float64
 8   AMT_CREDIT_MAX_OVERDUE  float64
 9   CNT_CREDIT_PROLONG      int64
 10  AMT_CREDIT_SUM          float64
 11  AMT_CREDIT_SUM_DEBT     float64
 12  AMT_CREDIT_SUM_LIMIT    float64
 13  AMT_CREDIT_SUM_OVERDUE  float64
 14  CREDIT_TYPE             object
 15  DAYS_CREDIT_UPDATE      int64
 16  AMT_ANNUITY             float64
dtypes: float64(8), int64(6), object(3)
memory usage: 222.6+ MB

In [4]:
data_riwayat_peminjaman_1 = data_riwayat_peminjaman_1[["SK_ID_CURR", "CREDIT_DAY_OVERDUE"]]
data_riwayat_peminjaman_1.head()

   SK_ID_CURR  CREDIT_DAY_OVERDUE
0      215354                   0
1      215354                   0
2      215354                   0
3      215354                   0
4      215354                   0

In [5]:
data_riwayat_peminjaman_1.isna().sum()

SK_ID_CURR            0
CREDIT_DAY_OVERDUE    0
dtype: int64

In [6]:
data_riwayat_peminjaman_2 = pd.read_csv("Task 5_home-credit-default-risk/POS_CASH_balance.csv")
data_riwayat_peminjaman_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10001358 entries, 0 to 10001357
Data columns (total 8 columns):
 #   Column                 Dtype
---  ------                 -----
 0   SK_ID_PREV             int64
 1   SK_ID_CURR             int64
 2   MONTHS_BALANCE         int64
 3   CNT_INSTALMENT         float64
 4   CNT_INSTALMENT_FUTURE  float64
 5   NAME_CONTRACT_STATUS   object
 6   SK_DPD                 int64
 7   SK_DPD_DEF             int64
dtypes: float64(2), int64(5), object(1)
memory usage: 610.4+ MB

In [7]:
data_riwayat_peminjaman_2 = data_riwayat_peminjaman_2[["SK_ID_CURR", "SK_DPD"]]
data_riwayat_peminjaman_2.head()

   SK_ID_CURR  SK_DPD
0      182943       0
1      367990       0
2      397406       0
3      269225       0
4      334279       0

In [8]:
data_riwayat_peminjaman_2.isna().sum()

SK_ID_CURR    0
SK_DPD        0
dtype: int64

In [9]:
data_riwayat_peminjaman_3 = pd.read_csv("Task 5_home-credit-default-risk/credit_card_balance.csv")
data_riwayat_peminjaman_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3840312 entries, 0 to 3840311
Data columns (total 23 columns):
 #   Column                      Dtype
---  ------                      -----
 0   SK_ID_PREV                  int64
 1   SK_ID_CURR                  int64
 2   MONTHS_BALANCE              int64
 3   AMT_BALANCE                 float64
 4   AMT_CREDIT_LIMIT_ACTUAL     int64
 5   AMT_DRAWINGS_ATM_CURRENT    float64
 6   AMT_DRAWINGS_CURRENT        float64
 7   AMT_DRAWINGS_OTHER_CURRENT  float64
 8   AMT_DRAWINGS_POS_CURRENT    float64
 9   AMT_INST_MIN_REGULARITY     float64
 10  AMT_PAYMENT_CURRENT         float64
 11  AMT_PAYMENT_TOTAL_CURRENT   float64
 12  AMT_RECEIVABLE_PRINCIPAL    float64
 13  AMT_RECIVABLE               float64
 14  AMT_TOTAL_RECEIVABLE        float64
 15  CNT_DRAWINGS_ATM_CURRENT    float64
 16  CNT_DRAWINGS_CURRENT        int64
 17  CNT_DRAWINGS_OTHER_CURRENT  float64
 18  CNT_DRAWINGS_POS_CURRENT    float64
 19  CNT_INSTALMENT_MATURE_CUM   float64
 20  NAME_CONTRACT_STATUS        object
 21  SK_DPD                      int64
 22  SK_DPD_DEF                  int64
dtypes: float64(15), int64(7), object(1)
memory usage: 673.9+ MB

In [10]:
data_riwayat_peminjaman_3 = data_riwayat_peminjaman_3[["SK_ID_CURR", "SK_DPD", "SK_DPD_DEF"]]
data_riwayat_peminjaman_3.head()

   SK_ID_CURR  SK_DPD  SK_DPD_DEF
0      378907       0           0
1      363914       0           0
2      371185       0           0
3      337855       0           0
4      126868       0           0

In [11]:
data_riwayat_peminjaman_3.isna().sum()

SK_ID_CURR    0
SK_DPD        0
SK_DPD_DEF    0
dtype: int64

In [12]:
data_riwayat_peminjaman = pd.merge(left=data_riwayat_peminjaman_1, right=data_riwayat_peminjaman_2, how="outer", left_on="SK_ID_CURR", right_on="SK_ID_CURR")
data_riwayat_peminjaman.head()

   SK_ID_CURR  CREDIT_DAY_OVERDUE  SK_DPD
0      215354                 0.0     0.0
1      215354                 0.0     0.0
2      215354                 0.0     0.0
3      215354                 0.0     0.0
4      215354                 0.0     0.0

In [13]:
data_riwayat_peminjaman.isna().sum()

SK_ID_CURR                  0
CREDIT_DAY_OVERDUE    1264267
SK_DPD                  71833
dtype: int64

In [12]:
data_riwayat_peminjaman_fix = data_riwayat_peminjaman.set_index("SK_ID_CURR").join(data_riwayat_peminjaman_3.set_index("SK_ID_CURR"), how="outer")
data_riwayat_peminjaman_fix.head()

KeyError: "None of ['SK_ID_CURR'] are in the columns"

In [ ]:
#Logistic Regression